In [2]:
import pandas as pd 

df = pd.read_csv('salaries.csv')

In [3]:
# Linear Regression with Multivariate Variables
df.head()

  experience  test_score_10  interview_score_10  salary
0        NaN            8.0                   9   50000
1        NaN            8.0                   6   45000
2       five            6.0                   7   60000
3        two           10.0                  10   65000
4      seven            9.0                   6   70000

In [4]:
df.shape

(8, 4)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   experience          6 non-null      object
 1   test_score_10       7 non-null      float64
 2   interview_score_10  8 non-null      int64
 3   salary              8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [6]:
df.isnull().sum()

experience            2
test_score_10         1
interview_score_10    0
salary                0
dtype: int64

In [8]:
df.describe()

       test_score_10  interview_score_10       salary
count       7.000000            8.000000      8.00000
mean        7.857143            7.875000  63000.00000
std         1.345185            1.642081  11501.55269
min         6.000000            6.000000  45000.00000
25%         7.000000            6.750000  57500.00000
50%         8.000000            7.500000  63500.00000
75%         8.500000            9.250000  70500.00000
max        10.000000           10.000000  80000.00000

In [9]:
df.experience = df.experience.fillna('zero')

In [11]:
df=df.fillna(df.median())

C:\Users\IFEANY~1\AppData\Local\Temp/ipykernel_30028/308181716.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df=df.fillna(df.median())

In [12]:
df

  experience  test_score_10  interview_score_10  salary
0       zero            8.0                   9   50000
1       zero            8.0                   6   45000
2       five            6.0                   7   60000
3        two           10.0                  10   65000
4      seven            9.0                   6   70000
5      three            7.0                  10   62000
6        ten            8.0                   7   72000
7     eleven            7.0                   8   80000

In [13]:
df.isnull().sum()

experience            0
test_score_10         0
interview_score_10    0
salary                0
dtype: int64

In [14]:
! pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5580 sha256=91388dd746a4833475c00a4c138f1353bc63eb77ed47db41427a3e38a8fc54bf
  Stored in directory: c:\users\ifeanyi pc\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [15]:
from word2number import w2n

df.experience = df.experience.apply(w2n.word_to_num)

In [18]:
df

   experience  test_score_10  interview_score_10  salary
0           0            8.0                   9   50000
1           0            8.0                   6   45000
2           5            6.0                   7   60000
3           2           10.0                  10   65000
4           7            9.0                   6   70000
5           3            7.0                  10   62000
6          10            8.0                   7   72000
7          11            7.0                   8   80000

In [19]:
from sklearn.linear_model import LinearRegression

In [20]:
X = df.drop('salary', axis = 1)
y = df.salary

In [21]:
X.head()
y.head()

0    50000
1    45000
2    60000
3    65000
4    70000
Name: salary, dtype: int64

In [22]:
model = LinearRegression()

In [23]:
model.fit(X,y)

LinearRegression()

In [24]:
model.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [25]:
model.intercept_

17737.26346433771

In [27]:
import joblib

joblib.dump(model, 'salary_model.pkl')

['salary_model.pkl']